# Irish Ag CA2

Countries chosen for this analysis are Ireland, Germany, Austrailia.

This analysis will focus on the Irish agricultural landscape and the impact that the move towards a more plant based diet has had on it's production/ imports/ exports in comparrison to other counties wehere veganism is also on the rise. 

From the Europe Dataset, the analysis will focus on Ireland, which will be the baseline for all analysis and then Germany. The Irish agriculture findings will then be compared against Germany as both countries benifit from the European Common agricultural Policy. The analysis will be looking for similarities & differences in each countries agriculture indistry. Germany has been chosen as a country for analysis as it is one of the countries with the highest % of vegans in Europe.

The analysis will go on to compare Irish agriculure against  Austraulia, one of the largest vegan populations in the world who do not benifit from being a member of the CAP.

## Import Initial Libraries 

Import Pandas and Numpy libraries. 

Pandas is a Python library used for data analysis. The Pandas library enables DataFrame and Series functionality used for analyzing the data. This library works with the tabular data, i.e data that is organized in a table with rows(observations) and columns(features). 

NumPy is a Python library used to perform mathematical and computing operations specific to arrays. The NumPy module works with the numerical data.
https://numpy.org/doc/stable/

Seaborn and Matplotlib libraries are used for data visualisation purposes to generate plots, graphs and other visuaisations of data.

In [1]:
#data manipulation libraries
import pandas as pd
import numpy as np

# data visualization Libraries
import seaborn as sns
from matplotlib import pyplot as plt

## Python Good Practice 
The following are also good practice to run at the start of every Analysis project to ensure the best results

In [2]:
# filter warnings
import warnings
warnings.filterwarnings("ignore")

# avoid blurry images
%config InLineBackend.figure_format = "retina"
sns.set_context=("talk")

# enable multiple cell outputs
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

## Import Datasets

There is both production and import/export of goods data available on https://www.fao.org/faostat/en/#data/QCL for all continents.

In this section both production and import/export data for Europe, Americas & Oceanias will be imported. Later this data will be go through EDA and data cleaning before moving onto analysis and visualisation. 

Population will also be imported for each country as to standardise analysis to per capita findings. 
Ireland population: https://fred.stlouisfed.org/series/POPTOTIEA647NWDB

In [3]:
#import dataset
europe = pd.read_csv("data\Production_Crops_Livestock_E_Europe_NOFLAG.csv")

europe.head()

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y1961,Y1962,Y1963,...,Y2011,Y2012,Y2013,Y2014,Y2015,Y2016,Y2017,Y2018,Y2019,Y2020
0,3,Albania,515,Apples,5312,Area harvested,ha,NaN,NaN,NaN,...,3450.0,3719.0,3838.0,3863.0,4008.0,4230.0,4346.0,4294.0,4407.0,4420.0
1,3,Albania,515,Apples,5419,Yield,hg/ha,NaN,NaN,NaN,...,185507.0,191718.0,197316.0,212426.0,228882.0,240028.0,221671.0,252387.0,240374.0,231147.0
2,3,Albania,515,Apples,5510,Production,tonnes,10004.0,8039.0,7931.0,...,64000.0,71300.0,75730.0,82060.0,91736.0,101532.0,96338.0,108375.0,105933.0,102167.0
3,3,Albania,526,Apricots,5312,Area harvested,ha,NaN,NaN,NaN,...,300.0,301.0,315.0,320.0,331.0,326.0,326.0,337.0,341.0,346.0
4,3,Albania,526,Apricots,5419,Yield,hg/ha,NaN,NaN,NaN,...,130000.0,147176.0,139683.0,129375.0,152417.0,159325.0,154601.0,152493.0,142962.0,148642.0

In [4]:
#import dataset
europe_trade = pd.read_csv("data\Trade_CropsLivestock_E_Europe_NOFLAG.csv")

europe_trade.head()

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y1961,Y1962,Y1963,...,Y2011,Y2012,Y2013,Y2014,Y2015,Y2016,Y2017,Y2018,Y2019,Y2020
0,3,Albania,862,Alfalfa meal and pellets,5610,Import Quantity,tonnes,NaN,NaN,NaN,...,290.0,0.0,0.0,NaN,NaN,NaN,NaN,NaN,5.0,NaN
1,3,Albania,862,Alfalfa meal and pellets,5622,Import Value,1000 US$,NaN,NaN,NaN,...,89.0,0.0,0.0,NaN,NaN,NaN,NaN,NaN,0.0,NaN
2,3,Albania,862,Alfalfa meal and pellets,5910,Export Quantity,tonnes,NaN,NaN,NaN,...,0.0,0.0,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,3,Albania,862,Alfalfa meal and pellets,5922,Export Value,1000 US$,NaN,NaN,NaN,...,0.0,0.0,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,3,Albania,231,Almonds shelled,5610,Import Quantity,tonnes,NaN,NaN,NaN,...,180.0,144.0,126.0,32.0,133.0,129.0,59.0,85.0,512.0,367.0

In [5]:
#import dataset
americas = pd.read_csv("data\Production_Crops_Livestock_E_Americas_NOFLAG.csv")

americas.head()

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y1961,Y1962,Y1963,...,Y2011,Y2012,Y2013,Y2014,Y2015,Y2016,Y2017,Y2018,Y2019,Y2020
0,8,Antigua and Barbuda,1107,Asses,5111,Stocks,Head,2300.0,2300.0,2300.0,...,1700.0,1700.0,1700.0,1700.0,1703.0,1707.0,1719.0,1719.0,1723.0,1726.0
1,8,Antigua and Barbuda,486,Bananas,5312,Area harvested,ha,NaN,NaN,NaN,...,28.0,35.0,32.0,35.0,37.0,41.0,44.0,48.0,52.0,11.0
2,8,Antigua and Barbuda,486,Bananas,5419,Yield,hg/ha,NaN,NaN,NaN,...,85357.0,71429.0,79688.0,74000.0,71081.0,56341.0,46364.0,37292.0,28846.0,4545.0
3,8,Antigua and Barbuda,486,Bananas,5510,Production,tonnes,NaN,NaN,NaN,...,239.0,250.0,255.0,259.0,263.0,231.0,204.0,179.0,150.0,5.0
4,8,Antigua and Barbuda,414,"Beans, green",5312,Area harvested,ha,1.0,1.0,2.0,...,24.0,25.0,25.0,25.0,25.0,25.0,26.0,26.0,26.0,26.0

In [6]:
#import dataset
americas_trade = pd.read_csv("data\Trade_CropsLivestock_E_Americas_NOFLAG.csv")

americas_trade.head()

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y1961,Y1962,Y1963,...,Y2011,Y2012,Y2013,Y2014,Y2015,Y2016,Y2017,Y2018,Y2019,Y2020
0,8,Antigua and Barbuda,862,Alfalfa meal and pellets,5610,Import Quantity,tonnes,NaN,NaN,NaN,...,NaN,NaN,NaN,0.0,0.0,0.0,0.0,0.0,0.0,NaN
1,8,Antigua and Barbuda,862,Alfalfa meal and pellets,5622,Import Value,1000 US$,NaN,NaN,NaN,...,NaN,NaN,NaN,1.0,1.0,0.0,0.0,0.0,0.0,NaN
2,8,Antigua and Barbuda,231,Almonds shelled,5610,Import Quantity,tonnes,NaN,NaN,NaN,...,NaN,36.0,8.0,12.0,16.0,12.0,16.0,16.0,13.0,1.0
3,8,Antigua and Barbuda,231,Almonds shelled,5622,Import Value,1000 US$,NaN,NaN,NaN,...,NaN,145.0,37.0,47.0,46.0,38.0,54.0,59.0,44.0,6.0
4,8,Antigua and Barbuda,231,Almonds shelled,5910,Export Quantity,tonnes,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,0.0,0.0,NaN,NaN,NaN

In [7]:
#import dataset
oceania = pd.read_csv("data\Production_Crops_Livestock_E_Oceania_NOFLAG.csv")

oceania.head()

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y1961,Y1962,Y1963,...,Y2011,Y2012,Y2013,Y2014,Y2015,Y2016,Y2017,Y2018,Y2019,Y2020
0,10,Australia,221,"Almonds, with shell",5312,Area harvested,ha,NaN,NaN,NaN,...,25666.0,26058.0,28586.0,28060.0,28190.0,28553.0,29282.0,31361.0,37903.0,39301.0
1,10,Australia,221,"Almonds, with shell",5419,Yield,hg/ha,NaN,NaN,NaN,...,32300.0,41907.0,56531.0,54337.0,55090.0,61170.0,63513.0,55164.0,55932.0,56458.0
2,10,Australia,221,"Almonds, with shell",5510,Production,tonnes,NaN,NaN,NaN,...,82900.0,109200.0,161600.0,152470.0,155300.0,174660.0,185980.0,173000.0,212000.0,221886.0
3,10,Australia,711,"Anise, badian, fennel, coriander",5312,Area harvested,ha,NaN,NaN,NaN,...,914.0,1015.0,1040.0,989.0,989.0,1006.0,987.0,994.0,996.0,992.0
4,10,Australia,711,"Anise, badian, fennel, coriander",5419,Yield,hg/ha,NaN,NaN,NaN,...,11368.0,11488.0,11548.0,11587.0,11608.0,11581.0,11581.0,11590.0,11576.0,11593.0

In [8]:
#import dataset
oceania_trade = pd.read_csv("data\Trade_CropsLivestock_E_Oceania_NOFLAG.csv")

oceania_trade.head()

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y1961,Y1962,Y1963,...,Y2011,Y2012,Y2013,Y2014,Y2015,Y2016,Y2017,Y2018,Y2019,Y2020
0,10,Australia,862,Alfalfa meal and pellets,5610,Import Quantity,tonnes,0.0,0.0,0.0,...,12.0,9.0,0.0,1.0,13.0,59.0,109.0,657.0,1003.0,1.0
1,10,Australia,862,Alfalfa meal and pellets,5622,Import Value,1000 US$,0.0,0.0,0.0,...,34.0,25.0,0.0,4.0,18.0,55.0,149.0,363.0,497.0,9.0
2,10,Australia,862,Alfalfa meal and pellets,5910,Export Quantity,tonnes,0.0,0.0,0.0,...,85992.0,77026.0,73652.0,97312.0,84691.0,81045.0,72941.0,52186.0,50680.0,40056.0
3,10,Australia,862,Alfalfa meal and pellets,5922,Export Value,1000 US$,0.0,0.0,0.0,...,25292.0,24082.0,23972.0,38488.0,27409.0,26811.0,20611.0,16656.0,16107.0,12946.0
4,10,Australia,231,Almonds shelled,5610,Import Quantity,tonnes,0.0,0.0,0.0,...,1164.0,2309.0,2515.0,2056.0,1904.0,2314.0,3061.0,3657.0,2784.0,2436.0

In [9]:
# import dataset
ireland_pop = pd.read_csv("data\irelandpop.csv")

columns = [ 'Year', 'Population_Ireland']
ireland_pop.columns = columns

# reformat year
ireland_pop['Year'] = ireland_pop['Year'].str[:4]

# drop year 1960 
ireland_pop.drop([0], axis=0, inplace=True)

# cast pop as int 
ireland_pop['Population_Ireland'] = ireland_pop['Population_Ireland'].astype('int')

ireland_pop.head()

   Year  Population_Ireland
1  1961             2824400
2  1962             2836050
3  1963             2852650
4  1964             2866550
5  1965             2877300

In [10]:
#import dataset
germany_pop = pd.read_csv("data\germanypop.csv")

columns = [ 'Year', 'Population_Germany']
germany_pop.columns = columns

#reformat year
germany_pop['Year'] = germany_pop['Year'].str[:4]

#drop year 1960 
germany_pop.drop([0], axis=0, inplace=True)

# cast pop as int 
germany_pop['Population_Germany'] = germany_pop['Population_Germany'].astype('int')

germany_pop.head()

   Year  Population_Germany
1  1961            73377632
2  1962            74025784
3  1963            74714353
4  1964            75318337
5  1965            75963695

In [11]:
#import dataset
us_pop = pd.read_csv("data\\americapop.csv")

columns = ['Year', 'Population_US']
us_pop.columns = columns

#reformat year
us_pop['Year'] = us_pop['Year'].str[:4]

#drop year 1960 
us_pop.drop([0], axis=0, inplace=True)

# cast pop as int 
us_pop['Population_US'] = us_pop['Population_US'].astype('int')

us_pop.head()

   Year  Population_US
1  1961      183691000
2  1962      186538000
3  1963      189242000
4  1964      191889000
5  1965      194303000

In [12]:
#import dataset
aus_pop = pd.read_csv("data\\australiapop.csv")

columns = [ 'Year', 'Population_Australia']
aus_pop.columns = columns

#reformat year
aus_pop['Year'] = aus_pop['Year'].str[:4]

#drop year 1960 
aus_pop.drop([0], axis=0, inplace=True)

# cast pop as int 
aus_pop['Population_Australia'] = aus_pop['Population_Australia'].astype('int')

aus_pop.head()

   Year  Population_Australia
1  1961              10483000
2  1962              10742000
3  1963              10950000
4  1964              11167000
5  1965              11388000

## Europe Production Dataset

The European Prouction Dataset is taken from faostat and contains annual data on all crops and animal products producted in  Europe from 1961-2020, measured in tonnes. It also contains information on livestock numbers, yields, areas havested and slaughtering numbers.

Unit Measurements:

    Production = tonnes
    Area harvested = ha
    Yield =	hg/ha
    Stocks = head 
    Slaughter = head
    Yields/ Carcass Weight = 0.1g/An, hg/An
    Milking Animals = head
    Laying = head
    Prod Popultn (bees/honey) = number

"Crop statistics are recorded for 173 products, covering the following categories: Crops Primary, Fibre Crops Primary, Cereals, Coarse Grain, Citrus Fruit, Fruit, Jute Jute-like Fibres, Oilcakes Equivalent, Oil crops Primary, Pulses, Roots and Tubers, Treenuts and Vegetables and Melons. Data are expressed in terms of area harvested, production quantity and yield. The objective is to comprehensively cover production of all primary crops for all countries and regions in the world. Area and production data on cereals relate to crops harvested for dry grain only. Cereal crops harvested for hay or harvested green for food, feed or silage or used for grazing are therefore excluded. Area data relate to harvested area. Some countries report sown or cultivated area only." https://www.fao.org/faostat/en/#data/QCL

In [13]:
#drop columns not required for analysis
to_drop = ['Area Code','Item Code','Element Code']
europe.drop(to_drop, inplace=True, axis=1)

### Melt Data

The current dataset is difficult to read as it has lots of columns for the different years of data. This dataset can be reshaped using the melt() function

In [14]:
# melt new dataframe in order to visualise data by street 
europe_melt = pd.melt(europe, id_vars=[ 'Area', 'Item', 'Element', 'Unit'])

# rename columns 
columns = [ 'Country', 'Crop_Livestock', 'Element', 'Unit', 'Year', 'Value']
europe_melt.columns = columns

#remove Y from year
europe_melt['Year'] = europe_melt['Year'].str[1:]

#set Year to datetime dtype
#europe_melt['Year']= pd.to_datetime(europe_melt['Year'])

europe_melt.head()

   Country Crop_Livestock         Element    Unit  Year    Value
0  Albania         Apples  Area harvested      ha  1961      NaN
1  Albania         Apples           Yield   hg/ha  1961      NaN
2  Albania         Apples      Production  tonnes  1961  10004.0
3  Albania       Apricots  Area harvested      ha  1961      NaN
4  Albania       Apricots           Yield   hg/ha  1961      NaN

In [15]:
# dataframe shape, number of rows/ columns 
europe_melt.shape

(959580, 6)

In [16]:
europe_melt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 959580 entries, 0 to 959579
Data columns (total 6 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Country         959580 non-null  object
 1   Crop_Livestock  959580 non-null  object
 2   Element         959580 non-null  object
 3   Unit            959580 non-null  object
 4   Year            959580 non-null  object
 5   Value           544700 non-null  float64
dtypes: float64(1), object(5)
memory usage: 43.9+ MB

### Missing Values

Missing values and 0 values reflect that there was no production/ harvest/ yield etc. in a given year for a given country for a given crop/livestock. As there is no difference in significance betwee 0 or NaN vlaues, these can be dropped. There is no need to interpolate for this analysis as it is important to see what was actually produced to ensure the integity of the analysis.

In [17]:
# number of missing values 
europe_melt.isnull().sum()

Country                0
Crop_Livestock         0
Element                0
Unit                   0
Year                   0
Value             414880
dtype: int64

In [18]:
#check the amount of 0's in each column
europe_melt_sparse = (europe_melt == 0).sum()
europe_melt_sparse

Country              0
Crop_Livestock       0
Element              0
Unit                 0
Year                 0
Value             8086
dtype: int64

In [19]:
# drop all rows with NaN and 0 values

# first will replace 0 values with NaNs  
europe_melt.replace(to_replace = 0, value = np.nan, inplace=True)

# row = 0, column = 1
europe_df = europe_melt.dropna(axis=0)

# check if we have any NaN values in our dataset
europe_df.isnull().values.any()

False

In [20]:
europe_df.shape

(536614, 6)

In [21]:
# cast value as int 
europe_df['Value'] = europe_df['Value'].astype('int')

## Ireland Production Datasets

In [22]:
# create irish dataset
ireland_prod_df = europe_df.loc[europe_df['Country']=='Ireland']

# irish production dataset - all products (crop, meat, livestock)
ireland_prod = ireland_prod_df.loc[ireland_prod_df['Element']=='Production']

#reset index
ireland_prod.reset_index(drop=True)

      Country            Crop_Livestock     Element    Unit  Year   Value
0     Ireland                    Apples  Production  tonnes  1961   29000
1     Ireland                    Barley  Production  tonnes  1961  515400
2     Ireland            Beer of barley  Production  tonnes  1961  363000
3     Ireland               Berries nes  Production  tonnes  1961    1000
4     Ireland          Butter, cow milk  Production  tonnes  1961   61300
...       ...                       ...         ...     ...   ...     ...
4742  Ireland  Oilcrops, Oil Equivalent  Production  tonnes  2020   16769
4743  Ireland             Pulses, Total  Production  tonnes  2020   60400
4744  Ireland   Roots and Tubers, Total  Production  tonnes  2020  300150
4745  Ireland       Sheep and Goat Meat  Production  tonnes  2020   66230
4746  Ireland        Vegetables Primary  Production  tonnes  2020  187590

[4747 rows x 6 columns]

In [23]:
# merge population data. Outer merge so no data is lost 
ireland_prod_pop = pd.merge(ireland_prod, ireland_pop, how="outer", on = ["Year"])
ireland_prod_pop.head()

,Country,Crop_Livestock,Element,Unit,Year,Value,Population_Ireland
0,Ireland,Apples,Production,tonnes,1961,29000,2824400
1,Ireland,Barley,Production,tonnes,1961,515400,2824400
2,Ireland,Beer of barley,Production,tonnes,1961,363000,2824400
3,Ireland,Berries nes,Production,tonnes,1961,1000,2824400
4,Ireland,"Butter, cow milk",Production,tonnes,1961,61300,2824400

In [24]:
ireland_prod_pop.shape

(4747, 7)

### Ireland Meat/ Dairy/ Crop Production

In [25]:
# irish production meat products
ireland_meat_prod = ireland_prod_pop.loc[ireland_prod_pop['Crop_Livestock'].str.contains('meat', case=False)]
ireland_meat_prod.rename(columns={'Crop_Livestock': 'Meat Type'}, inplace=True)
ireland_meat_prod.reset_index(drop=True)

# irish production dairy products
ireland_dairy_prod = ireland_prod_pop.loc[ireland_prod_pop['Crop_Livestock'].str.contains('milk', case=False)]
ireland_dairy_prod.rename(columns={'Crop_Livestock': 'Dairy Product'}, inplace=True)
ireland_dairy_prod.reset_index(drop=True)

# irish production crops
ireland_crop_prod = ireland_prod_pop.loc[ireland_prod_pop['Crop_Livestock'].str.contains('meat', case=False) == False]
ireland_crop_prod = ireland_crop_prod.loc[ireland_crop_prod['Crop_Livestock'].str.contains('milk', case=False) == False]
ireland_crop_prod.rename(columns={'Crop_Livestock': 'Crop'}, inplace=True)
ireland_crop_prod.reset_index(drop=True)

,Country,Meat Type,Element,Unit,Year,Value,Population_Ireland
0,Ireland,Meat nes,Production,tonnes,1961,5000,2824400
1,Ireland,"Meat, cattle",Production,tonnes,1961,144539,2824400
2,Ireland,"Meat, chicken",Production,tonnes,1961,10000,2824400
3,Ireland,"Meat, duck",Production,tonnes,1961,1400,2824400
4,Ireland,"Meat, goose and guinea fowl",Production,tonnes,1961,1000,2824400
...,...,...,...,...,...,...,...
763,Ireland,"Meat, turkey",Production,tonnes,2020,13560,4994724
764,Ireland,Beef and Buffalo Meat,Production,tonnes,2020,633380,4994724
765,Ireland,"Meat, Poultry",Production,tonnes,2020,165700,4994724
766,Ireland,"Meat, Total",Production,tonnes,2020,1188607,4994724
767,Ireland,Sheep and Goat Meat,Production,tonnes,2020,66230,4994724

,Country,Dairy Product,Element,Unit,Year,Value,Population_Ireland
0,Ireland,"Butter, cow milk",Production,tonnes,1961,61300,2824400
1,Ireland,"Cheese, whole cow milk",Production,tonnes,1961,6000,2824400
2,Ireland,"Milk, skimmed cow",Production,tonnes,1961,1423066,2824400
3,Ireland,"Milk, skimmed dried",Production,tonnes,1961,6000,2824400
4,Ireland,"Milk, whole condensed",Production,tonnes,1961,330,2824400
...,...,...,...,...,...,...,...
602,Ireland,Evaporat&Condensed Milk,Production,tonnes,2019,3800,4934340
603,Ireland,"Milk, Total",Production,tonnes,2019,8244870,4934340
604,Ireland,"Skim Milk&Buttermilk,Dry",Production,tonnes,2019,134300,4934340
605,Ireland,"Milk, whole fresh cow",Production,tonnes,2020,8561470,4994724
606,Ireland,"Milk, Total",Production,tonnes,2020,8561470,4994724

,Country,Crop,Element,Unit,Year,Value,Population_Ireland
0,Ireland,Apples,Production,tonnes,1961,29000,2824400
1,Ireland,Barley,Production,tonnes,1961,515400,2824400
2,Ireland,Beer of barley,Production,tonnes,1961,363000,2824400
3,Ireland,Berries nes,Production,tonnes,1961,1000,2824400
4,Ireland,Cabbages and other brassicas,Production,tonnes,1961,25000,2824400
...,...,...,...,...,...,...,...
3367,Ireland,"Oilcrops, Cake Equivalent",Production,tonnes,2020,26478,4994724
3368,Ireland,"Oilcrops, Oil Equivalent",Production,tonnes,2020,16769,4994724
3369,Ireland,"Pulses, Total",Production,tonnes,2020,60400,4994724
3370,Ireland,"Roots and Tubers, Total",Production,tonnes,2020,300150,4994724
3371,Ireland,Vegetables Primary,Production,tonnes,2020,187590,4994724

 ## Germany Production Datasets

In [26]:
# create german dataset
germany_prod_df = europe_df.loc[europe_df['Country']=='Germany']

# german production dataset - all products (crop, meat, livestock)
germany_prod = germany_prod_df.loc[germany_prod_df['Element']=='Production']

#reset index
germany_prod.reset_index(drop=True)

      Country           Crop_Livestock     Element    Unit  Year     Value
0     Germany                   Apples  Production  tonnes  1961    851000
1     Germany                 Apricots  Production  tonnes  1961      2900
2     Germany                Asparagus  Production  tonnes  1961     16300
3     Germany                   Barley  Production  tonnes  1961   3669020
4     Germany               Beans, dry  Production  tonnes  1961     12693
...       ...                      ...         ...     ...   ...       ...
7173  Germany            Pulses, Total  Production  tonnes  2020    567400
7174  Germany  Roots and Tubers, Total  Production  tonnes  2020  11715100
7175  Germany      Sheep and Goat Meat  Production  tonnes  2020     40000
7176  Germany      Sugar Crops Primary  Production  tonnes  2020  28618100
7177  Germany       Vegetables Primary  Production  tonnes  2020   3437190

[7178 rows x 6 columns]

In [27]:
# merge population data. Outer merge so no data is lost 
germany_prod_pop = pd.merge(germany_prod, germany_pop, how="outer", on = ["Year"])
germany_prod_pop.head()

,Country,Crop_Livestock,Element,Unit,Year,Value,Population_Germany
0,Germany,Apples,Production,tonnes,1961,851000,73377632
1,Germany,Apricots,Production,tonnes,1961,2900,73377632
2,Germany,Asparagus,Production,tonnes,1961,16300,73377632
3,Germany,Barley,Production,tonnes,1961,3669020,73377632
4,Germany,"Beans, dry",Production,tonnes,1961,12693,73377632

In [28]:
germany_prod_pop.shape

(7178, 7)

###  Germany Meat/ Dairy/ Crop Production

In [29]:
# german production meat products
germany_meat_prod = germany_prod_pop.loc[germany_prod_pop['Crop_Livestock'].str.contains('meat', case=False)]
germany_meat_prod.rename(columns={'Crop_Livestock': 'Meat Type'}, inplace=True)
germany_meat_prod.reset_index(drop=True)

# german production dairy products
germany_dairy_prod =  germany_prod_pop.loc[ germany_prod_pop['Crop_Livestock'].str.contains('milk', case=False)]
germany_dairy_prod.rename(columns={'Crop_Livestock': 'Dairy Product'}, inplace=True)
germany_dairy_prod.reset_index(drop=True)

# german production crops
germany_crop_prod =  germany_prod_pop.loc[ germany_prod_pop['Crop_Livestock'].str.contains('meat', case=False) == False]
germany_crop_prod = germany_crop_prod.loc[germany_crop_prod['Crop_Livestock'].str.contains('milk', case=False) == False]
germany_crop_prod.rename(columns={'Crop_Livestock': 'Crop'}, inplace=True)
germany_crop_prod.reset_index(drop=True)

,Country,Meat Type,Element,Unit,Year,Value,Population_Germany
0,Germany,"Meat, cattle",Production,tonnes,1961,1296200,73377632
1,Germany,"Meat, chicken",Production,tonnes,1961,150100,73377632
2,Germany,"Meat, duck",Production,tonnes,1961,10080,73377632
3,Germany,"Meat, game",Production,tonnes,1961,17000,73377632
4,Germany,"Meat, goat",Production,tonnes,1961,5648,73377632
...,...,...,...,...,...,...,...
884,Germany,"Meat, turkey",Production,tonnes,2020,476000,83240525
885,Germany,Beef and Buffalo Meat,Production,tonnes,2020,1091000,83240525
886,Germany,"Meat, Poultry",Production,tonnes,2020,1571538,83240525
887,Germany,"Meat, Total",Production,tonnes,2020,7822098,83240525
888,Germany,Sheep and Goat Meat,Production,tonnes,2020,40000,83240525

,Country,Dairy Product,Element,Unit,Year,Value,Population_Germany
0,Germany,"Butter, cow milk",Production,tonnes,1961,633900,73377632
1,Germany,"Cheese, goat milk",Production,tonnes,1961,39600,73377632
2,Germany,"Cheese, skimmed cow milk",Production,tonnes,1961,175300,73377632
3,Germany,"Cheese, whole cow milk",Production,tonnes,1961,204700,73377632
4,Germany,"Milk, skimmed cow",Production,tonnes,1961,14356399,73377632
...,...,...,...,...,...,...,...
856,Germany,"Milk, whole fresh buffalo",Production,tonnes,2020,1000,83240525
857,Germany,"Milk, whole fresh cow",Production,tonnes,2020,33164910,83240525
858,Germany,"Milk, whole fresh goat",Production,tonnes,2020,16280,83240525
859,Germany,"Milk, whole fresh sheep",Production,tonnes,2020,6700,83240525
860,Germany,"Milk, Total",Production,tonnes,2020,33188890,83240525

,Country,Crop,Element,Unit,Year,Value,Population_Germany
0,Germany,Apples,Production,tonnes,1961,851000,73377632
1,Germany,Apricots,Production,tonnes,1961,2900,73377632
2,Germany,Asparagus,Production,tonnes,1961,16300,73377632
3,Germany,Barley,Production,tonnes,1961,3669020,73377632
4,Germany,"Beans, dry",Production,tonnes,1961,12693,73377632
...,...,...,...,...,...,...,...
5423,Germany,"Oilcrops, Oil Equivalent",Production,tonnes,2020,1382194,83240525
5424,Germany,"Pulses, Total",Production,tonnes,2020,567400,83240525
5425,Germany,"Roots and Tubers, Total",Production,tonnes,2020,11715100,83240525
5426,Germany,Sugar Crops Primary,Production,tonnes,2020,28618100,83240525
5427,Germany,Vegetables Primary,Production,tonnes,2020,3437190,83240525

In [30]:
# Rename 2015 Columns
# dcc_2015_ff.rename(columns={' O_Connell_St_Outside_Clerys': 'OConnell_St_Clerys'}, inplace=True)

## European Trade Dataset

The European Trade Dataset is taken from faostat and contains annual data on all crop/ livestock/ animal product Imports and Exports in Europe from 1961-2020, measured in tonnes and heads. It also contains information on Import and Export values in $1000US.

Import/ Export Quantity Unit Measurements:

    Crops = tonnes
    Livestock = head
    Dairy Products = tonnes
    Meat animal Product = tonnes 

"The food and agricultural trade dataset is collected, processed and disseminated by FAO according to the standard International Merchandise Trade Statistics (IMTS) Methodology. The data is mainly provided by UNSD, Eurostat, and other national authorities as needed. This source data is checked for outliers, trade partner data is used for non-reporting countries or missing cells, and data on food aid is added to take into account total cross-border trade flows."  https://www.fao.org/faostat/en/#data/TCL

In [31]:
#drop columns not required for analysis
europe_trade.drop(to_drop, inplace=True, axis=1)

### Melt Data

In [32]:
# melt new dataframe in order to visualise data by street 
europe_trade_melt = pd.melt(europe_trade, id_vars=[ 'Area', 'Item', 'Element', 'Unit'])

# rename columns 
columns = [ 'Country', 'Crop_Livestock', 'Element', 'Unit', 'Year', 'Value']
europe_trade_melt.columns = columns

#remove Y from year
europe_trade_melt['Year'] = europe_trade_melt['Year'].str[1:]

#set Year to datetime dtype
#europe_melt['Year']= pd.to_datetime(europe_melt['Year'])

europe_trade_melt.head()

   Country            Crop_Livestock          Element      Unit  Year  Value
0  Albania  Alfalfa meal and pellets  Import Quantity    tonnes  1961    NaN
1  Albania  Alfalfa meal and pellets     Import Value  1000 US$  1961    NaN
2  Albania  Alfalfa meal and pellets  Export Quantity    tonnes  1961    NaN
3  Albania  Alfalfa meal and pellets     Export Value  1000 US$  1961    NaN
4  Albania           Almonds shelled  Import Quantity    tonnes  1961    NaN

In [33]:
# dataframe shape, number of rows/ columns 
europe_trade_melt.shape

(4092480, 6)

In [34]:
europe_trade_melt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4092480 entries, 0 to 4092479
Data columns (total 6 columns):
 #   Column          Dtype
---  ------          -----
 0   Country         object
 1   Crop_Livestock  object
 2   Element         object
 3   Unit            object
 4   Year            object
 5   Value           float64
dtypes: float64(1), object(5)
memory usage: 187.3+ MB

### Missing Values

In [35]:
# number of missing values 
europe_trade_melt.isnull().sum()

Country                 0
Crop_Livestock          0
Element                 0
Unit                    0
Year                    0
Value             1547041
dtype: int64

In [36]:
#check the amount of 0's in each column
europe_trade_melt_sparse = (europe_trade_melt == 0).sum()
europe_trade_melt_sparse

Country                0
Crop_Livestock         0
Element                0
Unit                   0
Year                   0
Value             496259
dtype: int64

In [37]:
# drop all rows with NaN and 0 values

# first will replace 0 values with NaNs  
europe_trade_melt.replace(to_replace = 0, value = np.nan, inplace=True)

# row = 0, column = 1
europe_trade_df = europe_trade_melt.dropna(axis=0)

# check if we have any NaN values in our dataset
europe_trade_df.isnull().values.any()

False

In [38]:
europe_trade_df.shape

(2049180, 6)

In [39]:
# cast value as int 
europe_trade_df['Value'] = europe_trade_df['Value'].astype('int')

## Ireland Trade Datasets

In [40]:
# create irish dataset
ireland_trade = europe_trade_df.loc[europe_trade_df['Country']=='Ireland']

# irish import/ export datasets - all products (crop, meat, livestock)
ireland_imports = ireland_trade.loc[ireland_trade['Element']=='Import Quantity']
ireland_exports = ireland_trade.loc[ireland_trade['Element']=='Export Quantity']

#reset index
ireland_imports.reset_index(drop=True)
ireland_exports.reset_index(drop=True)

       Country       Crop_Livestock          Element    Unit  Year  Value
0      Ireland      Almonds shelled  Import Quantity  tonnes  1961    493
1      Ireland               Apples  Import Quantity  tonnes  1961   9085
2      Ireland              Bananas  Import Quantity  tonnes  1961  11180
3      Ireland               Barley  Import Quantity  tonnes  1961   4544
4      Ireland      Barley, pearled  Import Quantity  tonnes  1961   2177
...        ...                  ...              ...     ...   ...    ...
18347  Ireland       Natural Rubber  Import Quantity  tonnes  2020    146
18348  Ireland       Textile Fibres  Import Quantity  tonnes  2020   1084
18349  Ireland      Hides and skins  Import Quantity  tonnes  2020    299
18350  Ireland  Crude Materials nes  Import Quantity  tonnes  2020    198
18351  Ireland              Tobacco  Import Quantity  tonnes  2020   3499

[18352 rows x 6 columns]

       Country       Crop_Livestock          Element    Unit  Year   Value
0      Ireland               Apples  Export Quantity  tonnes  1961      24
1      Ireland                Asses  Export Quantity    Head  1961    1362
2      Ireland        Bacon and ham  Export Quantity  tonnes  1961   28761
3      Ireland               Barley  Export Quantity  tonnes  1961    1755
4      Ireland       Beer of barley  Export Quantity  tonnes  1961  202407
...        ...                  ...              ...     ...   ...     ...
14527  Ireland       Natural Rubber  Export Quantity  tonnes  2020    3923
14528  Ireland       Textile Fibres  Export Quantity  tonnes  2020    3567
14529  Ireland      Hides and skins  Export Quantity  tonnes  2020   78565
14530  Ireland  Crude Materials nes  Export Quantity  tonnes  2020       3
14531  Ireland              Tobacco  Export Quantity  tonnes  2020       4

[14532 rows x 6 columns]

In [41]:
# merge population data. Outer merge so no data is lost 
ireland_imports = pd.merge(ireland_imports, ireland_pop, how="outer", on = ["Year"])
ireland_exports = pd.merge(ireland_exports, ireland_pop, how="outer", on = ["Year"])

ireland_imports.head()
ireland_exports.head()

,Country,Crop_Livestock,Element,Unit,Year,Value,Population_Ireland
0,Ireland,Almonds shelled,Import Quantity,tonnes,1961,493,2824400
1,Ireland,Apples,Import Quantity,tonnes,1961,9085,2824400
2,Ireland,Bananas,Import Quantity,tonnes,1961,11180,2824400
3,Ireland,Barley,Import Quantity,tonnes,1961,4544,2824400
4,Ireland,"Barley, pearled",Import Quantity,tonnes,1961,2177,2824400

,Country,Crop_Livestock,Element,Unit,Year,Value,Population_Ireland
0,Ireland,Apples,Export Quantity,tonnes,1961,24,2824400
1,Ireland,Asses,Export Quantity,Head,1961,1362,2824400
2,Ireland,Bacon and ham,Export Quantity,tonnes,1961,28761,2824400
3,Ireland,Barley,Export Quantity,tonnes,1961,1755,2824400
4,Ireland,Beer of barley,Export Quantity,tonnes,1961,202407,2824400

In [42]:
ireland_imports.shape
ireland_exports.shape

(18352, 7)

(14532, 7)

### Ireland Livestock/Meat/ Dairy/ Crops Import/Exports

In [43]:
# import/ export livestock
ireland_livestock_imports = ireland_imports.loc[ireland_imports['Unit'].str.contains('head', case=False)]
ireland_livestock_exports = ireland_exports.loc[ireland_exports['Unit'].str.contains('head', case=False)]
ireland_livestock_imports.rename(columns={'Crop_Livestock': 'Animal Type'}, inplace=True)
ireland_livestock_exports.rename(columns={'Crop_Livestock': 'Animal Type'}, inplace=True)
ireland_livestock_imports.reset_index(drop=True)
ireland_livestock_exports.reset_index(drop=True)

# import/ export meat products
ireland_meat_imports = ireland_imports.loc[ireland_imports['Crop_Livestock'].str.contains('meat', case=False)]
ireland_meat_exports = ireland_exports.loc[ireland_exports['Crop_Livestock'].str.contains('meat', case=False)]
ireland_meat_imports.rename(columns={'Crop_Livestock': 'Meat Type'}, inplace=True)
ireland_meat_exports.rename(columns={'Crop_Livestock': 'Meat Type'}, inplace=True)
ireland_meat_imports.reset_index(drop=True)
ireland_meat_exports.reset_index(drop=True)

# import/ export dairy products
ireland_dairy_imports = ireland_imports.loc[ireland_imports['Crop_Livestock'].str.contains('milk', case=False)]
ireland_dairy_exports = ireland_exports.loc[ireland_exports['Crop_Livestock'].str.contains('milk', case=False)]
ireland_dairy_imports.rename(columns={'Crop_Livestock': 'Dairy Type'}, inplace=True)
ireland_dairy_exports.rename(columns={'Crop_Livestock': 'Dairy Type'}, inplace=True)
ireland_dairy_imports.reset_index(drop=True)
ireland_dairy_exports.reset_index(drop=True)

# import/ export crops
ire_imports_tonnes = ireland_imports.loc[ireland_imports['Unit'].str.contains('tonne', case=False)]
ire_exports_tonnes = ireland_exports.loc[ireland_exports['Unit'].str.contains('tonne', case=False)]
ireland_crop_imports = ire_imports_tonnes.loc[ire_imports_tonnes['Crop_Livestock'].str.contains('meat', case=False) == False]
ireland_crop_exports = ire_exports_tonnes.loc[ire_exports_tonnes['Crop_Livestock'].str.contains('meat', case=False) == False]
ireland_crop_imports.rename(columns={'Crop_Livestock': 'Crop Type'}, inplace=True)
ireland_crop_exports.rename(columns={'Crop_Livestock': 'Crop Type'}, inplace=True)
ireland_crop_imports.reset_index(drop=True)
ireland_crop_exports.reset_index(drop=True)

,Country,Animal Type,Element,Unit,Year,Value,Population_Ireland
0,Ireland,Cattle,Import Quantity,Head,1961,159400,2824400
1,Ireland,Chickens,Import Quantity,1000 Head,1961,2010,2824400
2,Ireland,Horses,Import Quantity,Head,1961,1042,2824400
3,Ireland,Pigs,Import Quantity,Head,1961,3300,2824400
4,Ireland,Sheep,Import Quantity,Head,1961,367500,2824400
...,...,...,...,...,...,...,...
543,Ireland,Pigs,Import Quantity,Head,2020,6207,4994724
544,Ireland,Sheep,Import Quantity,Head,2020,363075,4994724
545,Ireland,Turkeys,Import Quantity,1000 Head,2020,472,4994724
546,Ireland,Other food,Import Quantity,1000 Head,2020,7502,4994724
547,Ireland,Other food,Import Quantity,Head,2020,387292,4994724

,Country,Animal Type,Element,Unit,Year,Value,Population_Ireland
0,Ireland,Asses,Export Quantity,Head,1961,1362,2824400
1,Ireland,Cattle,Export Quantity,Head,1961,722400,2824400
2,Ireland,Chickens,Export Quantity,1000 Head,1961,1490,2824400
3,Ireland,Horses,Export Quantity,Head,1961,18329,2824400
4,Ireland,Pigs,Export Quantity,Head,1961,2500,2824400
...,...,...,...,...,...,...,...
540,Ireland,Mules,Export Quantity,Head,2020,46,4994724
541,Ireland,Pigs,Export Quantity,Head,2020,100718,4994724
542,Ireland,Sheep,Export Quantity,Head,2020,18605,4994724
543,Ireland,Other food,Export Quantity,1000 Head,2020,3346,4994724
544,Ireland,Other food,Export Quantity,Head,2020,413549,4994724

,Country,Meat Type,Element,Unit,Year,Value,Population_Ireland
0,Ireland,"Meal, meat",Import Quantity,tonnes,1961,130,2824400
1,Ireland,"Meat, beef, preparations",Import Quantity,tonnes,1961,34,2824400
2,Ireland,"Meat, cattle",Import Quantity,tonnes,1961,11,2824400
3,Ireland,Bovine Meat,Import Quantity,tonnes,1961,55,2824400
4,Ireland,"Meal, meat",Import Quantity,tonnes,1962,1780,2836050
...,...,...,...,...,...,...,...
1087,Ireland,"Meat, turkey",Import Quantity,tonnes,2020,12771,4994724
1088,Ireland,Bovine Meat,Import Quantity,tonnes,2020,35961,4994724
1089,Ireland,Poultry Meat,Import Quantity,tonnes,2020,137083,4994724
1090,Ireland,Pigmeat,Import Quantity,tonnes,2020,92327,4994724
1091,Ireland,Other Meat,Import Quantity,tonnes,2020,17347,4994724

,Country,Meat Type,Element,Unit,Year,Value,Population_Ireland
0,Ireland,"Meal, meat",Export Quantity,tonnes,1961,460,2824400
1,Ireland,Meat nes,Export Quantity,tonnes,1961,440,2824400
2,Ireland,"Meat, beef and veal sausages",Export Quantity,tonnes,1961,388,2824400
3,Ireland,"Meat, beef, preparations",Export Quantity,tonnes,1961,8099,2824400
4,Ireland,"Meat, cattle",Export Quantity,tonnes,1961,38746,2824400
...,...,...,...,...,...,...,...
1276,Ireland,"Meat, turkey",Export Quantity,tonnes,2020,4986,4994724
1277,Ireland,Bovine Meat,Export Quantity,tonnes,2020,629991,4994724
1278,Ireland,Poultry Meat,Export Quantity,tonnes,2020,136086,4994724
1279,Ireland,Pigmeat,Export Quantity,tonnes,2020,292607,4994724
1280,Ireland,Other Meat,Export Quantity,tonnes,2020,104079,4994724

,Country,Dairy Type,Element,Unit,Year,Value,Population_Ireland
0,Ireland,"Butter, cow milk",Import Quantity,tonnes,1961,41,2824400
1,Ireland,"Cheese, whole cow milk",Import Quantity,tonnes,1961,140,2824400
2,Ireland,"Milk, skimmed cow",Import Quantity,tonnes,1961,45,2824400
3,Ireland,"Milk, whole dried",Import Quantity,tonnes,1961,23,2824400
4,Ireland,"Milk, whole evaporated",Import Quantity,tonnes,1961,4,2824400
...,...,...,...,...,...,...,...
527,Ireland,"Milk, skimmed dried",Import Quantity,tonnes,2020,26061,4994724
528,Ireland,"Milk, whole condensed",Import Quantity,tonnes,2020,4019,4994724
529,Ireland,"Milk, whole dried",Import Quantity,tonnes,2020,11815,4994724
530,Ireland,"Milk, whole evaporated",Import Quantity,tonnes,2020,319,4994724
531,Ireland,"Milk, whole fresh cow",Import Quantity,tonnes,2020,615153,4994724

,Country,Dairy Type,Element,Unit,Year,Value,Population_Ireland
0,Ireland,"Butter, cow milk",Export Quantity,tonnes,1961,15399,2824400
1,Ireland,"Cheese, whole cow milk",Export Quantity,tonnes,1961,2370,2824400
2,Ireland,"Milk, skimmed dried",Export Quantity,tonnes,1961,6199,2824400
3,Ireland,"Milk, whole condensed",Export Quantity,tonnes,1961,325,2824400
4,Ireland,"Milk, whole dried",Export Quantity,tonnes,1961,4772,2824400
...,...,...,...,...,...,...,...
530,Ireland,"Milk, skimmed dried",Export Quantity,tonnes,2020,157308,4994724
531,Ireland,"Milk, whole condensed",Export Quantity,tonnes,2020,999,4994724
532,Ireland,"Milk, whole dried",Export Quantity,tonnes,2020,74474,4994724
533,Ireland,"Milk, whole evaporated",Export Quantity,tonnes,2020,119,4994724
534,Ireland,"Milk, whole fresh cow",Export Quantity,tonnes,2020,144609,4994724

,Country,Crop Type,Element,Unit,Year,Value,Population_Ireland
0,Ireland,Almonds shelled,Import Quantity,tonnes,1961,493,2824400
1,Ireland,Apples,Import Quantity,tonnes,1961,9085,2824400
2,Ireland,Bananas,Import Quantity,tonnes,1961,11180,2824400
3,Ireland,Barley,Import Quantity,tonnes,1961,4544,2824400
4,Ireland,"Barley, pearled",Import Quantity,tonnes,1961,2177,2824400
...,...,...,...,...,...,...,...
16707,Ireland,Natural Rubber,Import Quantity,tonnes,2020,146,4994724
16708,Ireland,Textile Fibres,Import Quantity,tonnes,2020,1084,4994724
16709,Ireland,Hides and skins,Import Quantity,tonnes,2020,299,4994724
16710,Ireland,Crude Materials nes,Import Quantity,tonnes,2020,198,4994724
16711,Ireland,Tobacco,Import Quantity,tonnes,2020,3499,4994724

,Country,Crop Type,Element,Unit,Year,Value,Population_Ireland
0,Ireland,Apples,Export Quantity,tonnes,1961,24,2824400
1,Ireland,Bacon and ham,Export Quantity,tonnes,1961,28761,2824400
2,Ireland,Barley,Export Quantity,tonnes,1961,1755,2824400
3,Ireland,Beer of barley,Export Quantity,tonnes,1961,202407,2824400
4,Ireland,Beet pulp,Export Quantity,tonnes,1961,4169,2824400
...,...,...,...,...,...,...,...
12701,Ireland,Natural Rubber,Export Quantity,tonnes,2020,3923,4994724
12702,Ireland,Textile Fibres,Export Quantity,tonnes,2020,3567,4994724
12703,Ireland,Hides and skins,Export Quantity,tonnes,2020,78565,4994724
12704,Ireland,Crude Materials nes,Export Quantity,tonnes,2020,3,4994724
12705,Ireland,Tobacco,Export Quantity,tonnes,2020,4,4994724

## Germany Trade Datasets

In [44]:
# create german dataset
germany_trade = europe_trade_df.loc[europe_trade_df['Country']=='Germany']

# german import/ export datasets - all products (crop, meat, livestock)
germany_imports = germany_trade.loc[germany_trade['Element']=='Import Quantity']
germany_exports = germany_trade.loc[germany_trade['Element']=='Export Quantity']

#reset index
germany_imports.reset_index(drop=True)
germany_exports.reset_index(drop=True)

,Country,Crop_Livestock,Element,Unit,Year,Value
0,Germany,Alfalfa meal and pellets,Import Quantity,tonnes,1961,33778
1,Germany,Almonds shelled,Import Quantity,tonnes,1961,23384
2,Germany,"Anise, badian, fennel, coriander",Import Quantity,tonnes,1961,3536
3,Germany,Apples,Import Quantity,tonnes,1961,599555
4,Germany,Apricots,Import Quantity,tonnes,1961,21201
...,...,...,...,...,...,...
21085,Germany,Natural Rubber,Import Quantity,tonnes,2020,227255
21086,Germany,Textile Fibres,Import Quantity,tonnes,2020,123808
21087,Germany,Hides and skins,Import Quantity,tonnes,2020,78147
21088,Germany,Crude Materials nes,Import Quantity,tonnes,2020,10892
21089,Germany,Tobacco,Import Quantity,tonnes,2020,250418

,Country,Crop_Livestock,Element,Unit,Year,Value
0,Germany,Almonds shelled,Export Quantity,tonnes,1961,185
1,Germany,"Anise, badian, fennel, coriander",Export Quantity,tonnes,1961,61
2,Germany,Apples,Export Quantity,tonnes,1961,730
3,Germany,Asses,Export Quantity,Head,1961,11
4,Germany,Bacon and ham,Export Quantity,tonnes,1961,144
...,...,...,...,...,...,...
20584,Germany,Natural Rubber,Export Quantity,tonnes,2020,47020
20585,Germany,Textile Fibres,Export Quantity,tonnes,2020,40259
20586,Germany,Hides and skins,Export Quantity,tonnes,2020,145146
20587,Germany,Crude Materials nes,Export Quantity,tonnes,2020,25657
20588,Germany,Tobacco,Export Quantity,tonnes,2020,184314

In [45]:
# merge population data. Outer merge so no data is lost 
germany_imports = pd.merge(germany_imports, germany_pop, how="outer", on = ["Year"])
germany_exports = pd.merge(germany_exports, germany_pop, how="outer", on = ["Year"])

germany_imports.head()
germany_exports.head()

,Country,Crop_Livestock,Element,Unit,Year,Value,Population_Germany
0,Germany,Alfalfa meal and pellets,Import Quantity,tonnes,1961,33778,73377632
1,Germany,Almonds shelled,Import Quantity,tonnes,1961,23384,73377632
2,Germany,"Anise, badian, fennel, coriander",Import Quantity,tonnes,1961,3536,73377632
3,Germany,Apples,Import Quantity,tonnes,1961,599555,73377632
4,Germany,Apricots,Import Quantity,tonnes,1961,21201,73377632

,Country,Crop_Livestock,Element,Unit,Year,Value,Population_Germany
0,Germany,Almonds shelled,Export Quantity,tonnes,1961,185,73377632
1,Germany,"Anise, badian, fennel, coriander",Export Quantity,tonnes,1961,61,73377632
2,Germany,Apples,Export Quantity,tonnes,1961,730,73377632
3,Germany,Asses,Export Quantity,Head,1961,11,73377632
4,Germany,Bacon and ham,Export Quantity,tonnes,1961,144,73377632

In [46]:
germany_imports.shape
germany_exports.shape

(21090, 7)

(20589, 7)

### Germany Livestock/ Meat / Dairy/ Crops Imports/ Exports

In [47]:
# import/ export livestock
germany_livestock_imports = germany_imports.loc[germany_imports['Unit'].str.contains('head', case=False)]
germany_livestock_exports = germany_exports.loc[germany_exports['Unit'].str.contains('head', case=False)]
germany_livestock_imports.rename(columns={'Crop_Livestock': 'Animal Type'}, inplace=True)
germany_livestock_exports.rename(columns={'Crop_Livestock': 'Animal Type'}, inplace=True)
germany_livestock_imports.reset_index(drop=True)
germany_livestock_exports.reset_index(drop=True)

# import/ export meat products
germany_meat_imports = germany_imports.loc[germany_imports['Crop_Livestock'].str.contains('meat', case=False)]
germany_meat_exports = germany_exports.loc[germany_exports['Crop_Livestock'].str.contains('meat', case=False)]
germany_meat_imports.rename(columns={'Crop_Livestock': 'Meat Type'}, inplace=True)
germany_meat_exports.rename(columns={'Crop_Livestock': 'Meat Type'}, inplace=True)
germany_meat_imports.reset_index(drop=True)
germany_meat_exports.reset_index(drop=True)

# import/ export dairy products
germany_dairy_imports = germany_imports.loc[germany_imports['Crop_Livestock'].str.contains('milk', case=False)]
germany_dairy_exports = germany_exports.loc[germany_exports['Crop_Livestock'].str.contains('milk', case=False)]
germany_dairy_imports.rename(columns={'Crop_Livestock': 'Dairy Type'}, inplace=True)
germany_dairy_exports.rename(columns={'Crop_Livestock': 'Dairy Type'}, inplace=True)
germany_dairy_imports.reset_index(drop=True)
germany_dairy_exports.reset_index(drop=True)

# import/ export crops
ger_imports_tonnes = germany_imports.loc[germany_imports['Unit'].str.contains('tonne', case=False)]
ger_exports_tonnes = germany_exports.loc[germany_exports['Unit'].str.contains('tonne', case=False)]
germany_crop_imports = ger_imports_tonnes.loc[ger_imports_tonnes['Crop_Livestock'].str.contains('meat', case=False) == False]
germany_crop_exports = ger_exports_tonnes.loc[ger_exports_tonnes['Crop_Livestock'].str.contains('meat', case=False) == False]
germany_crop_imports.rename(columns={'Crop_Livestock': 'Crop Type'}, inplace=True)
germany_crop_exports.rename(columns={'Crop_Livestock': 'Crop Type'}, inplace=True)
germany_crop_imports.reset_index(drop=True)
germany_crop_exports.reset_index(drop=True)

,Country,Animal Type,Element,Unit,Year,Value,Population_Germany
0,Germany,Asses,Import Quantity,Head,1961,25,73377632
1,Germany,Cattle,Import Quantity,Head,1961,449000,73377632
2,Germany,Chickens,Import Quantity,1000 Head,1961,2622,73377632
3,Germany,Horses,Import Quantity,Head,1961,2946,73377632
4,Germany,Pigs,Import Quantity,Head,1961,775446,73377632
...,...,...,...,...,...,...,...
685,Germany,Pigs,Import Quantity,Head,2020,12389432,83240525
686,Germany,Sheep,Import Quantity,Head,2020,159809,83240525
687,Germany,Turkeys,Import Quantity,1000 Head,2020,12482,83240525
688,Germany,Other food,Import Quantity,1000 Head,2020,161969,83240525
689,Germany,Other food,Import Quantity,Head,2020,12588487,83240525

,Country,Animal Type,Element,Unit,Year,Value,Population_Germany
0,Germany,Asses,Export Quantity,Head,1961,11,73377632
1,Germany,Cattle,Export Quantity,Head,1961,11400,73377632
2,Germany,Chickens,Export Quantity,1000 Head,1961,244,73377632
3,Germany,Goats,Export Quantity,Head,1961,31,73377632
4,Germany,Horses,Export Quantity,Head,1961,30861,73377632
...,...,...,...,...,...,...,...
654,Germany,Pigs,Export Quantity,Head,2020,2180304,83240525
655,Germany,Sheep,Export Quantity,Head,2020,15134,83240525
656,Germany,Turkeys,Export Quantity,1000 Head,2020,25947,83240525
657,Germany,Other food,Export Quantity,1000 Head,2020,283376,83240525
658,Germany,Other food,Export Quantity,Head,2020,2960673,83240525

,Country,Meat Type,Element,Unit,Year,Value,Population_Germany
0,Germany,"Meal, meat",Import Quantity,tonnes,1961,5760,73377632
1,Germany,Meat nes,Import Quantity,tonnes,1961,520,73377632
2,Germany,"Meat, beef, preparations",Import Quantity,tonnes,1961,4950,73377632
3,Germany,"Meat, cattle",Import Quantity,tonnes,1961,165858,73377632
4,Germany,"Meat, chicken",Import Quantity,tonnes,1961,169900,73377632
...,...,...,...,...,...,...,...
1397,Germany,"Meat, turkey",Import Quantity,tonnes,2020,106109,83240525
1398,Germany,Bovine Meat,Import Quantity,tonnes,2020,468439,83240525
1399,Germany,Poultry Meat,Import Quantity,tonnes,2020,852917,83240525
1400,Germany,Pigmeat,Import Quantity,tonnes,2020,1060569,83240525
1401,Germany,Other Meat,Import Quantity,tonnes,2020,107510,83240525

,Country,Meat Type,Element,Unit,Year,Value,Population_Germany
0,Germany,"Meal, meat",Export Quantity,tonnes,1961,2520,73377632
1,Germany,"Meat, beef, preparations",Export Quantity,tonnes,1961,1600,73377632
2,Germany,"Meat, cattle",Export Quantity,tonnes,1961,10737,73377632
3,Germany,"Meat, chicken",Export Quantity,tonnes,1961,1110,73377632
4,Germany,"Meat, chicken, canned",Export Quantity,tonnes,1961,88,73377632
...,...,...,...,...,...,...,...
1374,Germany,"Meat, turkey",Export Quantity,tonnes,2020,95490,83240525
1375,Germany,Bovine Meat,Export Quantity,tonnes,2020,362029,83240525
1376,Germany,Poultry Meat,Export Quantity,tonnes,2020,694194,83240525
1377,Germany,Pigmeat,Export Quantity,tonnes,2020,2817983,83240525
1378,Germany,Other Meat,Export Quantity,tonnes,2020,18103,83240525

,Country,Dairy Type,Element,Unit,Year,Value,Population_Germany
0,Germany,"Butter, cow milk",Import Quantity,tonnes,1961,28077,73377632
1,Germany,"Cheese, whole cow milk",Import Quantity,tonnes,1961,129849,73377632
2,Germany,"Milk, skimmed dried",Import Quantity,tonnes,1961,7035,73377632
3,Germany,"Milk, whole dried",Import Quantity,tonnes,1961,11137,73377632
4,Germany,"Milk, whole evaporated",Import Quantity,tonnes,1961,6340,73377632
...,...,...,...,...,...,...,...
568,Germany,"Milk, skimmed dried",Import Quantity,tonnes,2020,68419,83240525
569,Germany,"Milk, whole condensed",Import Quantity,tonnes,2020,17368,83240525
570,Germany,"Milk, whole dried",Import Quantity,tonnes,2020,42098,83240525
571,Germany,"Milk, whole evaporated",Import Quantity,tonnes,2020,96750,83240525
572,Germany,"Milk, whole fresh cow",Import Quantity,tonnes,2020,2445785,83240525

,Country,Dairy Type,Element,Unit,Year,Value,Population_Germany
0,Germany,"Butter, cow milk",Export Quantity,tonnes,1961,1,73377632
1,Germany,"Cheese, whole cow milk",Export Quantity,tonnes,1961,11836,73377632
2,Germany,"Milk, skimmed dried",Export Quantity,tonnes,1961,2416,73377632
3,Germany,"Milk, whole dried",Export Quantity,tonnes,1961,150,73377632
4,Germany,"Milk, whole evaporated",Export Quantity,tonnes,1961,150,73377632
...,...,...,...,...,...,...,...
569,Germany,"Milk, skimmed dried",Export Quantity,tonnes,2020,368873,83240525
570,Germany,"Milk, whole condensed",Export Quantity,tonnes,2020,36603,83240525
571,Germany,"Milk, whole dried",Export Quantity,tonnes,2020,59370,83240525
572,Germany,"Milk, whole evaporated",Export Quantity,tonnes,2020,265672,83240525
573,Germany,"Milk, whole fresh cow",Export Quantity,tonnes,2020,1565157,83240525

,Country,Crop Type,Element,Unit,Year,Value,Population_Germany
0,Germany,Alfalfa meal and pellets,Import Quantity,tonnes,1961,33778,73377632
1,Germany,Almonds shelled,Import Quantity,tonnes,1961,23384,73377632
2,Germany,"Anise, badian, fennel, coriander",Import Quantity,tonnes,1961,3536,73377632
3,Germany,Apples,Import Quantity,tonnes,1961,599555,73377632
4,Germany,Apricots,Import Quantity,tonnes,1961,21201,73377632
...,...,...,...,...,...,...,...
18991,Germany,Natural Rubber,Import Quantity,tonnes,2020,227255,83240525
18992,Germany,Textile Fibres,Import Quantity,tonnes,2020,123808,83240525
18993,Germany,Hides and skins,Import Quantity,tonnes,2020,78147,83240525
18994,Germany,Crude Materials nes,Import Quantity,tonnes,2020,10892,83240525
18995,Germany,Tobacco,Import Quantity,tonnes,2020,250418,83240525

,Country,Crop Type,Element,Unit,Year,Value,Population_Germany
0,Germany,Almonds shelled,Export Quantity,tonnes,1961,185,73377632
1,Germany,"Anise, badian, fennel, coriander",Export Quantity,tonnes,1961,61,73377632
2,Germany,Apples,Export Quantity,tonnes,1961,730,73377632
3,Germany,Bacon and ham,Export Quantity,tonnes,1961,144,73377632
4,Germany,Bananas,Export Quantity,tonnes,1961,2960,73377632
...,...,...,...,...,...,...,...
18544,Germany,Natural Rubber,Export Quantity,tonnes,2020,47020,83240525
18545,Germany,Textile Fibres,Export Quantity,tonnes,2020,40259,83240525
18546,Germany,Hides and skins,Export Quantity,tonnes,2020,145146,83240525
18547,Germany,Crude Materials nes,Export Quantity,tonnes,2020,25657,83240525
18548,Germany,Tobacco,Export Quantity,tonnes,2020,184314,83240525

## Oceania Production Dataset

The Oceania Prouction Dataset is taken from faostat and contains annual data on all crops and animal products producted throughout the Oceania region from 1961-2020, measured in tonnes. It also contains information on livestock numbers, yields, areas havested and slaughtering numbers.

Unit Measurements:

    Production = tonnes
    Area harvested = ha
    Yield =	hg/ha
    Stocks = head 
    Slaughter = head
    Yields/ Carcass Weight = 0.1g/An, hg/An
    Milking Animals = head
    Laying = head
    Prod Popultn (bees/honey) = number

"Crop statistics are recorded for 173 products, covering the following categories: Crops Primary, Fibre Crops Primary, Cereals, Coarse Grain, Citrus Fruit, Fruit, Jute Jute-like Fibres, Oilcakes Equivalent, Oil crops Primary, Pulses, Roots and Tubers, Treenuts and Vegetables and Melons. Data are expressed in terms of area harvested, production quantity and yield. The objective is to comprehensively cover production of all primary crops for all countries and regions in the world. Area and production data on cereals relate to crops harvested for dry grain only. Cereal crops harvested for hay or harvested green for food, feed or silage or used for grazing are therefore excluded. Area data relate to harvested area. Some countries report sown or cultivated area only." https://www.fao.org/faostat/en/#data/QCL

In [48]:
#drop columns not required for analysis
to_drop = ['Area Code','Item Code','Element Code']
oceania.drop(to_drop, inplace=True, axis=1)

### Melt Data

In [118]:
# melt new dataframe in order to visualise data by street 
oceania_melt = pd.melt(oceania, id_vars=[ 'Area', 'Item', 'Element', 'Unit'])

# rename columns 
columns = [ 'Country', 'Crop_Livestock', 'Element', 'Unit', 'Year', 'Value']
oceania_melt.columns = columns

#remove Y from year
oceania_melt['Year'] = oceania_melt['Year'].str[1:]

#set Year to datetime dtype
#oceania_melt['Year']= pd.to_datetime(europe_melt['Year'])

oceania_melt

,Country,Crop_Livestock,Element,Unit,Year,Value
0,Australia,"Almonds, with shell",Area harvested,ha,1961,NaN
1,Australia,"Almonds, with shell",Yield,hg/ha,1961,NaN
2,Australia,"Almonds, with shell",Production,tonnes,1961,NaN
3,Australia,"Anise, badian, fennel, coriander",Area harvested,ha,1961,NaN
4,Australia,"Anise, badian, fennel, coriander",Yield,hg/ha,1961,NaN
...,...,...,...,...,...,...
161095,Vanuatu,Sheep and Goat Meat,Producing Animals/Slaughtered,Head,2020,3224.0
161096,Vanuatu,Sheep and Goats,Stocks,Head,2020,15981.0
161097,Vanuatu,Vegetables Primary,Area harvested,ha,2020,823.0
161098,Vanuatu,Vegetables Primary,Yield,hg/ha,2020,161276.0
161099,Vanuatu,Vegetables Primary,Production,tonnes,2020,13273.0

In [119]:
# dataframe shape, number of rows/ columns 
oceania_melt.shape

(161100, 6)

In [120]:
oceania_melt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 161100 entries, 0 to 161099
Data columns (total 6 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Country         161100 non-null  object
 1   Crop_Livestock  161100 non-null  object
 2   Element         161100 non-null  object
 3   Unit            161100 non-null  object
 4   Year            161100 non-null  object
 5   Value           139641 non-null  float64
dtypes: float64(1), object(5)
memory usage: 7.4+ MB

### Missing Values

In [121]:
# number of missing values 
oceania_melt.isnull().sum()

Country               0
Crop_Livestock        0
Element               0
Unit                  0
Year                  0
Value             21459
dtype: int64

In [122]:
#check the amount of 0's in each column
oceania_melt_sparse = (oceania_melt == 0).sum()
oceania_melt_sparse

Country              0
Crop_Livestock       0
Element              0
Unit                 0
Year                 0
Value             1226
dtype: int64

In [123]:
# drop all rows with NaN and 0 values

# first will replace 0 values with NaNs  
oceania_melt.replace(to_replace = 0, value = np.nan, inplace=True)

# row = 0, column = 1
oceania_df = oceania_melt.dropna(axis=0)

# check if we have any NaN values in our dataset
oceania_df.isnull().values.any()

False

In [124]:
oceania_df.shape

(138415, 6)

In [125]:
# cast value as int 
oceania_df['Value'] = oceania_df['Value'].astype('int')

In [126]:
oceania_df

,Country,Crop_Livestock,Element,Unit,Year,Value
6,Australia,Apples,Area harvested,ha,1961,26656
7,Australia,Apples,Yield,hg/ha,1961,110682
8,Australia,Apples,Production,tonnes,1961,295034
9,Australia,Apricots,Area harvested,ha,1961,3794
10,Australia,Apricots,Yield,hg/ha,1961,107251
...,...,...,...,...,...,...
161095,Vanuatu,Sheep and Goat Meat,Producing Animals/Slaughtered,Head,2020,3224
161096,Vanuatu,Sheep and Goats,Stocks,Head,2020,15981
161097,Vanuatu,Vegetables Primary,Area harvested,ha,2020,823
161098,Vanuatu,Vegetables Primary,Yield,hg/ha,2020,161276
161099,Vanuatu,Vegetables Primary,Production,tonnes,2020,13273

## Australia Production Datasets

In [127]:
# create australian dataset
oz_df = oceania_df.loc[oceania_df['Country']=='Australia']

# australian production dataset - all products (crop, meat, livestock)
oz_prod = oz_df.loc[oz_df['Element']=='Production']

#reset index
oz_prod.reset_index(drop=True)

        Country           Crop_Livestock     Element    Unit  Year     Value
0     Australia                   Apples  Production  tonnes  1961    295034
1     Australia                 Apricots  Production  tonnes  1961     40691
2     Australia                Asparagus  Production  tonnes  1961      5262
3     Australia                 Avocados  Production  tonnes  1961       400
4     Australia                  Bananas  Production  tonnes  1961    123863
...         ...                      ...         ...     ...   ...       ...
8825  Australia  Roots and Tubers, Total  Production  tonnes  2020   1153974
8826  Australia      Sheep and Goat Meat  Production  tonnes  2020    716862
8827  Australia      Sugar Crops Primary  Production  tonnes  2020  30283457
8828  Australia          Treenuts, Total  Production  tonnes  2020    271326
8829  Australia       Vegetables Primary  Production  tonnes  2020   1588764

[8830 rows x 6 columns]

In [128]:
# merge population data. Outer merge so no data is lost 
oz_prod_pop = pd.merge(oz_prod, aus_pop, how="inner", on = ["Year"])
oz_prod_pop.head()

,Country,Crop_Livestock,Element,Unit,Year,Value,Population_Australia
0,Australia,Apples,Production,tonnes,1961,295034,10483000
1,Australia,Apricots,Production,tonnes,1961,40691,10483000
2,Australia,Asparagus,Production,tonnes,1961,5262,10483000
3,Australia,Avocados,Production,tonnes,1961,400,10483000
4,Australia,Bananas,Production,tonnes,1961,123863,10483000

In [129]:
oz_prod_pop.shape

(8830, 7)

### Australia Meat/ Dairy/ Crop Production

In [130]:
# australian production meat products
oz_meat_prod = oz_prod_pop.loc[oz_prod_pop['Crop_Livestock'].str.contains('meat', case=False)]
oz_meat_prod.rename(columns={'Crop_Livestock': 'Meat Type'}, inplace=True)
oz_meat_prod.reset_index(drop=True)

# australian production dairy products
oz_dairy_prod = oz_prod_pop.loc[oz_prod_pop['Crop_Livestock'].str.contains('milk', case=False)]
oz_dairy_prod.rename(columns={'Crop_Livestock': 'Dairy Product'}, inplace=True)
oz_dairy_prod.reset_index(drop=True)

# australian production crops
oz_crop_prod = oz_prod_pop.loc[oz_prod_pop['Crop_Livestock'].str.contains('meat', case=False) == False]
oz_crop_prod = oz_crop_prod.loc[oz_crop_prod['Crop_Livestock'].str.contains('milk', case=False) == False]
oz_crop_prod.rename(columns={'Crop_Livestock': 'Crop'}, inplace=True)
oz_crop_prod.reset_index(drop=True)

,Country,Meat Type,Element,Unit,Year,Value,Population_Australia
0,Australia,"Meat, cattle",Production,tonnes,1961,642924,10483000
1,Australia,"Meat, chicken",Production,tonnes,1961,46858,10483000
2,Australia,"Meat, duck",Production,tonnes,1961,830,10483000
3,Australia,"Meat, goat",Production,tonnes,1961,250,10483000
4,Australia,"Meat, horse",Production,tonnes,1961,14840,10483000
...,...,...,...,...,...,...,...
715,Australia,"Meat, turkey",Production,tonnes,2020,18530,25687041
716,Australia,Beef and Buffalo Meat,Production,tonnes,2020,2371600,25687041
717,Australia,"Meat, Poultry",Production,tonnes,2020,1281824,25687041
718,Australia,"Meat, Total",Production,tonnes,2020,4796869,25687041
719,Australia,Sheep and Goat Meat,Production,tonnes,2020,716862,25687041

,Country,Dairy Product,Element,Unit,Year,Value,Population_Australia
0,Australia,"Butter, cow milk",Production,tonnes,1961,182100,10483000
1,Australia,"Cheese, whole cow milk",Production,tonnes,1961,47700,10483000
2,Australia,"Milk, dry buttermilk",Production,tonnes,1961,7954,10483000
3,Australia,"Milk, skimmed condensed",Production,tonnes,1961,5085,10483000
4,Australia,"Milk, skimmed cow",Production,tonnes,1961,3698900,10483000
...,...,...,...,...,...,...,...
775,Australia,Evaporat&Condensed Milk,Production,tonnes,2019,48056,25365745
776,Australia,"Milk, Total",Production,tonnes,2019,8795038,25365745
777,Australia,"Skim Milk&Buttermilk,Dry",Production,tonnes,2019,208299,25365745
778,Australia,"Milk, whole fresh cow",Production,tonnes,2020,8797000,25687041
779,Australia,"Milk, Total",Production,tonnes,2020,8797000,25687041

,Country,Crop,Element,Unit,Year,Value,Population_Australia
0,Australia,Apples,Production,tonnes,1961,295034,10483000
1,Australia,Apricots,Production,tonnes,1961,40691,10483000
2,Australia,Asparagus,Production,tonnes,1961,5262,10483000
3,Australia,Avocados,Production,tonnes,1961,400,10483000
4,Australia,Bananas,Production,tonnes,1961,123863,10483000
...,...,...,...,...,...,...,...
7325,Australia,"Pulses, Total",Production,tonnes,2020,1913154,25687041
7326,Australia,"Roots and Tubers, Total",Production,tonnes,2020,1153974,25687041
7327,Australia,Sugar Crops Primary,Production,tonnes,2020,30283457,25687041
7328,Australia,"Treenuts, Total",Production,tonnes,2020,271326,25687041
7329,Australia,Vegetables Primary,Production,tonnes,2020,1588764,25687041

## Oceania Trade Dataset

The Oceania Trade Dataset is taken from faostat and contains annual data on all crop/ livestock/ animal product Imports and Exports throughout the Oceania region from 1961-2020, measured in tonnes and heads. It also contains information on Import and Export values in $1000US.

Import/ Export Quantity Unit Measurements:

    Crops = tonnes
    Livestock = head
    Dairy Products = tonnes
    Meat animal Product = tonnes 

"The food and agricultural trade dataset is collected, processed and disseminated by FAO according to the standard International Merchandise Trade Statistics (IMTS) Methodology. The data is mainly provided by UNSD, Eurostat, and other national authorities as needed. This source data is checked for outliers, trade partner data is used for non-reporting countries or missing cells, and data on food aid is added to take into account total cross-border trade flows."  https://www.fao.org/faostat/en/#data/TCL

In [69]:
#drop columns not required for analysis
oceania_trade.drop(to_drop, inplace=True, axis=1)

### Melt Data

In [93]:
# melt new dataframe in order to visualise data by street 
oceania_trade_melt = pd.melt(oceania_trade, id_vars=[ 'Area', 'Item', 'Element', 'Unit'])

# rename columns 
columns = [ 'Country', 'Crop_Livestock', 'Element', 'Unit', 'Year', 'Value']
oceania_trade_melt.columns = columns

#remove Y from year
oceania_trade_melt['Year'] = oceania_trade_melt['Year'].str[1:]

#set Year to datetime dtype
#europe_melt['Year']= pd.to_datetime(europe_melt['Year'])

oceania_trade_melt.head()

     Country            Crop_Livestock          Element      Unit  Year  Value
0  Australia  Alfalfa meal and pellets  Import Quantity    tonnes  1961    0.0
1  Australia  Alfalfa meal and pellets     Import Value  1000 US$  1961    0.0
2  Australia  Alfalfa meal and pellets  Export Quantity    tonnes  1961    0.0
3  Australia  Alfalfa meal and pellets     Export Value  1000 US$  1961    0.0
4  Australia           Almonds shelled  Import Quantity    tonnes  1961    0.0

In [71]:
# dataframe shape, number of rows/ columns 
oceania_trade_melt.shape

(973620, 6)

In [72]:
oceania_trade_melt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 973620 entries, 0 to 973619
Data columns (total 6 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Country         973620 non-null  object
 1   Crop_Livestock  973620 non-null  object
 2   Element         973620 non-null  object
 3   Unit            973620 non-null  object
 4   Year            973620 non-null  object
 5   Value           548192 non-null  float64
dtypes: float64(1), object(5)
memory usage: 44.6+ MB

### Missing Values

In [73]:
# number of missing values 
oceania_trade_melt.isnull().sum()

Country                0
Crop_Livestock         0
Element                0
Unit                   0
Year                   0
Value             425428
dtype: int64

In [74]:
#check the amount of 0's in each column
oceania_trade_melt_sparse = (oceania_trade_melt == 0).sum()
oceania_trade_melt_sparse

Country                0
Crop_Livestock         0
Element                0
Unit                   0
Year                   0
Value             188846
dtype: int64

In [75]:
# drop all rows with NaN and 0 values

# first will replace 0 values with NaNs  
oceania_trade_melt.replace(to_replace = 0, value = np.nan, inplace=True)

# row = 0, column = 1
oceania_trade_df = oceania_trade_melt.dropna(axis=0)

# check if we have any NaN values in our dataset
oceania_trade_df.isnull().values.any()

False

In [76]:
oceania_trade_df.shape

(359346, 6)

In [77]:
# cast value as int 
oceania_trade_df['Value'] = oceania_trade_df['Value'].astype('int')

## Australia Trade Datasets

In [78]:
# create australian dataset
oz_trade = oceania_trade_df.loc[oceania_trade_df['Country']=='Australia']

# australian import/ export datasets - all products (crop, meat, livestock)
oz_imports = oz_trade.loc[oz_trade['Element']=='Import Quantity']
oz_exports = oz_trade.loc[oz_trade['Element']=='Export Quantity']

#reset index
oz_imports.reset_index(drop=True)
oz_exports.reset_index(drop=True)

,Country,Crop_Livestock,Element,Unit,Year,Value
0,Australia,"Beans, dry",Import Quantity,tonnes,1961,4035
1,Australia,Beer of barley,Import Quantity,tonnes,1961,300
2,Australia,"Beverages, distilled alcoholic",Import Quantity,tonnes,1961,15790
3,Australia,"Beverages, non alcoholic",Import Quantity,tonnes,1961,100
4,Australia,Bread,Import Quantity,tonnes,1961,1000
...,...,...,...,...,...,...
14877,Australia,Natural Rubber,Import Quantity,tonnes,2020,6794
14878,Australia,Textile Fibres,Import Quantity,tonnes,2020,11940
14879,Australia,Hides and skins,Import Quantity,tonnes,2020,7927
14880,Australia,Crude Materials nes,Import Quantity,tonnes,2020,978
14881,Australia,Tobacco,Import Quantity,tonnes,2020,12328

         Country       Crop_Livestock          Element    Unit  Year   Value
0      Australia               Apples  Export Quantity  tonnes  1961  109140
1      Australia        Bacon and ham  Export Quantity  tonnes  1961     180
2      Australia               Barley  Export Quantity  tonnes  1961  768800
3      Australia       Beer of barley  Export Quantity  tonnes  1961    7000
4      Australia              Beeswax  Export Quantity  tonnes  1961      90
...          ...                  ...              ...     ...   ...     ...
15281  Australia       Textile Fibres  Export Quantity  tonnes  2020  422636
15282  Australia      Hides and skins  Export Quantity  tonnes  2020  312067
15283  Australia  Crude Materials nes  Export Quantity  tonnes  2020    1306
15284  Australia  Crude Materials nes  Export Quantity      No  2020    5534
15285  Australia              Tobacco  Export Quantity  tonnes  2020     385

[15286 rows x 6 columns]

In [79]:
# merge population data. Outer merge so no data is lost 
oz_imports = pd.merge(oz_imports, aus_pop, how="outer", on = ["Year"])
oz_exports = pd.merge(oz_exports, aus_pop, how="outer", on = ["Year"])

oz_imports.head()
oz_exports.head()

,Country,Crop_Livestock,Element,Unit,Year,Value,Population_Australia
0,Australia,"Beans, dry",Import Quantity,tonnes,1961,4035,10483000
1,Australia,Beer of barley,Import Quantity,tonnes,1961,300,10483000
2,Australia,"Beverages, distilled alcoholic",Import Quantity,tonnes,1961,15790,10483000
3,Australia,"Beverages, non alcoholic",Import Quantity,tonnes,1961,100,10483000
4,Australia,Bread,Import Quantity,tonnes,1961,1000,10483000

,Country,Crop_Livestock,Element,Unit,Year,Value,Population_Australia
0,Australia,Apples,Export Quantity,tonnes,1961,109140,10483000
1,Australia,Bacon and ham,Export Quantity,tonnes,1961,180,10483000
2,Australia,Barley,Export Quantity,tonnes,1961,768800,10483000
3,Australia,Beer of barley,Export Quantity,tonnes,1961,7000,10483000
4,Australia,Beeswax,Export Quantity,tonnes,1961,90,10483000

In [80]:
oz_imports.shape
oz_exports.shape

(14882, 7)

(15286, 7)

### Australia Livestock/ Meat / Dairy/ Crops Imports/ Exports

In [81]:
# import/ export livestock
oz_livestock_imports = oz_imports.loc[oz_imports['Unit'].str.contains('head', case=False)]
oz_livestock_exports = oz_exports.loc[oz_exports['Unit'].str.contains('head', case=False)]
oz_livestock_imports.rename(columns={'Crop_Livestock': 'Animal Type'}, inplace=True)
oz_livestock_exports.rename(columns={'Crop_Livestock': 'Animal Type'}, inplace=True)
oz_livestock_imports.reset_index(drop=True)
oz_livestock_exports.reset_index(drop=True)

# import/ export meat products
oz_meat_imports = oz_imports.loc[oz_imports['Crop_Livestock'].str.contains('meat', case=False)]
oz_meat_exports = oz_exports.loc[oz_exports['Crop_Livestock'].str.contains('meat', case=False)]
oz_meat_imports.rename(columns={'Crop_Livestock': 'Meat Type'}, inplace=True)
oz_meat_exports.rename(columns={'Crop_Livestock': 'Meat Type'}, inplace=True)
oz_meat_imports.reset_index(drop=True)
oz_meat_exports.reset_index(drop=True)

# import/ export dairy products
oz_dairy_imports = oz_imports.loc[oz_imports['Crop_Livestock'].str.contains('milk', case=False)]
oz_dairy_exports = oz_exports.loc[oz_exports['Crop_Livestock'].str.contains('milk', case=False)]
oz_dairy_imports.rename(columns={'Crop_Livestock': 'Dairy Type'}, inplace=True)
oz_dairy_exports.rename(columns={'Crop_Livestock': 'Dairy Type'}, inplace=True)
oz_dairy_imports.reset_index(drop=True)
oz_dairy_exports.reset_index(drop=True)

# import/ export crops
aus_imports_tonnes = oz_imports.loc[oz_imports['Unit'].str.contains('tonne', case=False)]
aus_exports_tonnes = oz_exports.loc[oz_exports['Unit'].str.contains('tonne', case=False)]
oz_crop_imports = aus_imports_tonnes.loc[aus_imports_tonnes['Crop_Livestock'].str.contains('meat', case=False) == False]
oz_crop_exports = aus_exports_tonnes.loc[aus_exports_tonnes['Crop_Livestock'].str.contains('meat', case=False) == False]
oz_crop_imports.rename(columns={'Crop_Livestock': 'Crop Type'}, inplace=True)
oz_crop_exports.rename(columns={'Crop_Livestock': 'Crop Type'}, inplace=True)
oz_crop_imports.reset_index(drop=True)
oz_crop_exports.reset_index(drop=True)

,Country,Animal Type,Element,Unit,Year,Value,Population_Australia
0,Australia,Horses,Import Quantity,Head,1961,300,10483000
1,Australia,Other food,Import Quantity,Head,1961,300,10483000
2,Australia,Horses,Import Quantity,Head,1962,300,10742000
3,Australia,Other food,Import Quantity,Head,1962,300,10742000
4,Australia,Horses,Import Quantity,Head,1963,311,10950000
...,...,...,...,...,...,...,...
237,Australia,Asses,Import Quantity,Head,2019,9,25365745
238,Australia,Horses,Import Quantity,Head,2019,2191,25365745
239,Australia,Other food,Import Quantity,Head,2019,2200,25365745
240,Australia,Horses,Import Quantity,Head,2020,2387,25687041
241,Australia,Other food,Import Quantity,Head,2020,2387,25687041

,Country,Animal Type,Element,Unit,Year,Value,Population_Australia
0,Australia,Cattle,Export Quantity,Head,1961,10200,10483000
1,Australia,Horses,Export Quantity,Head,1961,400,10483000
2,Australia,Pigs,Export Quantity,Head,1961,100,10483000
3,Australia,Sheep,Export Quantity,Head,1961,147600,10483000
4,Australia,Other food,Export Quantity,Head,1961,158300,10483000
...,...,...,...,...,...,...,...
496,Australia,Horses,Export Quantity,Head,2020,1674,25687041
497,Australia,Mules,Export Quantity,Head,2020,1,25687041
498,Australia,Sheep,Export Quantity,Head,2020,842968,25687041
499,Australia,Other food,Export Quantity,1000 Head,2020,192,25687041
500,Australia,Other food,Export Quantity,Head,2020,1963633,25687041

,Country,Meat Type,Element,Unit,Year,Value,Population_Australia
0,Australia,"Meal, meat",Import Quantity,tonnes,1961,470,10483000
1,Australia,Meat nes,Import Quantity,tonnes,1961,650,10483000
2,Australia,"Meat, chicken, canned",Import Quantity,tonnes,1961,953,10483000
3,Australia,Poultry Meat,Import Quantity,tonnes,1961,1382,10483000
4,Australia,Other Meat,Import Quantity,tonnes,1961,650,10483000
...,...,...,...,...,...,...,...
876,Australia,"Meat, sheep",Import Quantity,tonnes,2020,863,25687041
877,Australia,Bovine Meat,Import Quantity,tonnes,2020,14234,25687041
878,Australia,Poultry Meat,Import Quantity,tonnes,2020,2717,25687041
879,Australia,Pigmeat,Import Quantity,tonnes,2020,188024,25687041
880,Australia,Other Meat,Import Quantity,tonnes,2020,1666,25687041

,Country,Meat Type,Element,Unit,Year,Value,Population_Australia
0,Australia,"Meal, meat",Export Quantity,tonnes,1961,3690,10483000
1,Australia,"Meat, beef, preparations",Export Quantity,tonnes,1961,11122,10483000
2,Australia,"Meat, cattle",Export Quantity,tonnes,1961,550,10483000
3,Australia,"Meat, cattle, boneless (beef & veal)",Export Quantity,tonnes,1961,145614,10483000
4,Australia,"Meat, chicken",Export Quantity,tonnes,1961,191,10483000
...,...,...,...,...,...,...,...
1124,Australia,"Meat, turkey",Export Quantity,tonnes,2020,2490,25687041
1125,Australia,Bovine Meat,Export Quantity,tonnes,2020,1581146,25687041
1126,Australia,Poultry Meat,Export Quantity,tonnes,2020,42445,25687041
1127,Australia,Pigmeat,Export Quantity,tonnes,2020,43350,25687041
1128,Australia,Other Meat,Export Quantity,tonnes,2020,482574,25687041

,Country,Dairy Type,Element,Unit,Year,Value,Population_Australia
0,Australia,"Cheese, whole cow milk",Import Quantity,tonnes,1961,1567,10483000
1,Australia,"Milk, whole dried",Import Quantity,tonnes,1961,865,10483000
2,Australia,"Cheese, whole cow milk",Import Quantity,tonnes,1962,1907,10742000
3,Australia,"Milk, whole dried",Import Quantity,tonnes,1962,124,10742000
4,Australia,"Cheese, whole cow milk",Import Quantity,tonnes,1963,2422,10950000
...,...,...,...,...,...,...,...
414,Australia,"Milk, skimmed dried",Import Quantity,tonnes,2020,15866,25687041
415,Australia,"Milk, whole condensed",Import Quantity,tonnes,2020,7275,25687041
416,Australia,"Milk, whole dried",Import Quantity,tonnes,2020,43116,25687041
417,Australia,"Milk, whole evaporated",Import Quantity,tonnes,2020,1456,25687041
418,Australia,"Milk, whole fresh cow",Import Quantity,tonnes,2020,4749,25687041

,Country,Dairy Type,Element,Unit,Year,Value,Population_Australia
0,Australia,"Butter, cow milk",Export Quantity,tonnes,1961,62118,10483000
1,Australia,"Cheese, whole cow milk",Export Quantity,tonnes,1961,18326,10483000
2,Australia,"Milk, skimmed dried",Export Quantity,tonnes,1961,15300,10483000
3,Australia,"Milk, whole condensed",Export Quantity,tonnes,1961,17322,10483000
4,Australia,"Milk, whole dried",Export Quantity,tonnes,1961,7120,10483000
...,...,...,...,...,...,...,...
513,Australia,"Milk, skimmed dried",Export Quantity,tonnes,2020,128552,25687041
514,Australia,"Milk, whole condensed",Export Quantity,tonnes,2020,20255,25687041
515,Australia,"Milk, whole dried",Export Quantity,tonnes,2020,36806,25687041
516,Australia,"Milk, whole evaporated",Export Quantity,tonnes,2020,29960,25687041
517,Australia,"Milk, whole fresh cow",Export Quantity,tonnes,2020,236240,25687041

,Country,Crop Type,Element,Unit,Year,Value,Population_Australia
0,Australia,"Beans, dry",Import Quantity,tonnes,1961,4035,10483000
1,Australia,Beer of barley,Import Quantity,tonnes,1961,300,10483000
2,Australia,"Beverages, distilled alcoholic",Import Quantity,tonnes,1961,15790,10483000
3,Australia,"Beverages, non alcoholic",Import Quantity,tonnes,1961,100,10483000
4,Australia,Bread,Import Quantity,tonnes,1961,1000,10483000
...,...,...,...,...,...,...,...
13752,Australia,Natural Rubber,Import Quantity,tonnes,2020,6794,25687041
13753,Australia,Textile Fibres,Import Quantity,tonnes,2020,11940,25687041
13754,Australia,Hides and skins,Import Quantity,tonnes,2020,7927,25687041
13755,Australia,Crude Materials nes,Import Quantity,tonnes,2020,978,25687041
13756,Australia,Tobacco,Import Quantity,tonnes,2020,12328,25687041

,Country,Crop Type,Element,Unit,Year,Value,Population_Australia
0,Australia,Apples,Export Quantity,tonnes,1961,109140,10483000
1,Australia,Bacon and ham,Export Quantity,tonnes,1961,180,10483000
2,Australia,Barley,Export Quantity,tonnes,1961,768800,10483000
3,Australia,Beer of barley,Export Quantity,tonnes,1961,7000,10483000
4,Australia,Beeswax,Export Quantity,tonnes,1961,90,10483000
...,...,...,...,...,...,...,...
13633,Australia,Natural Rubber,Export Quantity,tonnes,2020,88,25687041
13634,Australia,Textile Fibres,Export Quantity,tonnes,2020,422636,25687041
13635,Australia,Hides and skins,Export Quantity,tonnes,2020,312067,25687041
13636,Australia,Crude Materials nes,Export Quantity,tonnes,2020,1306,25687041
13637,Australia,Tobacco,Export Quantity,tonnes,2020,385,25687041